'''Задание 1:
Пользователь вводит с клавиатуры арифметическое выражение. Например, 23+12. Необходимо вывести на экран результат выражения.
В нашем примере это 35. Арифметическое выражение может состоять только из трёх частей: число, операция, число.
Возможные операции: +, -,*,/
Задание 2:
В списке целых, заполненном случайными числами, определить минимальный и максимальный элементы,
посчитать количество отрицательных элементов, посчитать количество положительных элементов, посчитать количество нулей.
Результаты вывести на экран.'''
#Задание №1
x = input("Введите арифметическое выражение (например, 23+12) (использовать можно только +; -; * и /): ")
z = ['+', '-', '*', '/']    #задаю новый список с необходимыми по условиям значениями
z1 = 0                      #создаю переменную для найденного значения
for op in z:                #и запсукаю цикл для поиска в введеном пользователем выражении арифметического знака
    if op in x:
        z1 = op             #присваиваю значение найденного знака введенной ранее переменной
        break
if z1:                      #если найденный по условиям знак присутсвует, то запускаю ветвление
    n1, n2 = x.split(z1)    #разделяю выражение на число до знака и после знака
    n1 = int(n1)            #и присваиваю им тип данных целые числа
    n2 = int(n2)
    if z1 == '+':           #произвожу необходимый расчет в зависимости от найденного знака
        r = n1 + n2
    elif z1 == '-':
        r = n1 - n2
    elif z1 == '*':
        r = n1 * n2
    elif z1 == '/':
        r = n1 / n2
    else:
        r = "Вы ввели некорректное выражение. Прочитайте условия и попробуйте снова"

    # Вывод результата на экран
    print(f"Результат введенного Вами выражения {x} равен: {r}")
else:
    print("Вы ввели некорректное выражение. Внимательно прочитайте условия и попробуйте снова")
#Задание №2
import random                            #импортирую модуль random
x = []                                   #создаю переменную с пустым списком
for a in range(10):                      #запускаю цикл для создания 10 значений
    r = random.randint(-5000, 5000)   #генерирую случайные целые числа в указанном диапазоне
    x.append(r)                          #и добавляю в ранее созданную переменную (список)
min = min(x)                             #вычисляю минимальное число в списке
max = max(x)                             #вычисляю максимальное число в списке
o = 0                                    #ввожу переменную для отрицательных чисел
for y in x:                              #запускаю цикл для вычисления количества отрицательных чисел в списке
    if y < 0:                            #ввожу условие
        o += 1                           #и присваиваю ранее введенной переменной новое значение
p = 0                                    #аналогичные действия для вычисления количества положительных чисел в нашем списке
for y in x:
    if y > 0:
        p += 1
z = 0                                    #и для вычисления количества нулей
for y in x:
    if y == 0:
        z += 1
print("Список случайных чисел:", x)
print("Минимальное число в списке: ", min)
print("Максимальное число в списке: ", max)
print("Количество отрицательных чисел в спсике: ", o)
print("Количество положительных чисел в списке: ", p)
print("Количество нулей в списке: ", z)
