'''Задание 1.
Выведите на экран надпись To be or not to be на разных строках.
Пример вывода: To be
 or not
 to be
Задание 2.
Выведите на экран надпись «Life is what happens when you're busy making other
plans» John Lennon на разных строках.
Пример вывода:
 “Life is what happens when
 you’re busy making
 other plans” John Lennon.
Задание 3.
Определите тип данных 10 и '10'
Результат выведите на экран
Домашнее задание №4
Задание 4.
Выведите на экран треугольник из звездочек
Пример вывода:
*
**
***
****
*****'''
#Задание №1 (решил использовать один оператор print с символом переноса на новую строку)
print ('To be\nor not\nto be')
#Второй вариант решения
print ('To be')
print ('or not')
print ('to be')
#Задание №2 (использовал функцию print 3 раза в связи с использованием в задании символов " и ')
print('"Life is what happens when')
print("    you're busy making")
print('          other plans" John Lennon.')
#Задание №3 (определил так потому что 10 в обрамлении апострофами Python воспринимает как тип данных str (строка)
print('Тип данных 10:',type(10))
print("Тип данных '10':",type('10'))
#Либо второй вариант, c "ручным" определением типа данных
print('Тип данных 10: int (целое число)')
print("Тип данных '10': str (строка)")
#Задание №4 (сделал по аналогии с первым заданием)
print('*\n**\n***\n*****\n******')