'''Задание 1
Пользователь вводит с клавиатуры строку. Проверьте
является ли введенная строка палиндромом. Палиндром - слово или текст, которые одинаково читаются слева направо и
справа налево. Например, кок; А роза упала на лапу Азора; доход; А буду я у дуба.
Задание 2
Пользователь вводит с клавиатуры некоторый текст, после чего пользователь вводит список зарезервированных
слов. Необходимо найти в тексте все зарезервированные слова и изменить их регистр на верхний. Вывести на
экран измененный текст.
Задание 3
Есть некоторый текст. Посчитайте в этом тексте количество предложений и выведите на экран полученный результат.'''
#Задание №1
x = input("Введите Вашу строку: ")
z = ''.join(x.split())  #ввожу новую переменную и использую два метода (split и join) для удаления пробелов и соединения вновь в один набор символов
y = z.lower()           #перевожу строку в нижний регистр для независимости проверки от введеного пользователем регистра символов
if y == y[::-1]:        # и провожу проверку является ли строка в обратном порядке изначальной строке
    print("Введенная Вами строка является палиндромом.")
else:
    print("Введенная Вами строка не является палиндромом.")
#Задание №2
x = input("Введите Ваш текст: ")
y = input("Введите список зарезервированных слов через пробел: ").split() #сразу разделяю слова методом.split
z = x.split()                  #ввел новую переменную для разделения на слова в введеном пользователем тексте
for i in range(len(z)):        #запускаю цикл для изменения регистра зарезервинованых слов
    if z[i] in y:
        z[i] = z[i].upper()
n = ' '.join(z)                #и соединяю получившиеся слова обратно в строку
print("Ваш измененный текст: ", n)
#Задание №3
x = input("Введите Ваш текст: ")
z = False               #ввожу переменную для проверки введены ли буквы и принимаю ее за ложь
for b in x:             #запускаю цикл для проверки введенного текста на наличие буквенных символов
    if b.isalpha():
        z = True        #и присваиваю ему значение истины, если буквенные сиволы обнаружены
        break           #если не обнаружены - завершаем программу выводом требования ввода корректного текста
if z == True:           #запускаю ветвление если обнаружены буквенные символы
    y = x.count('.') + x.count('!') + x.count('?')  # считаю кол-во знаков которыми заканчиваются предложения
    if y != 0 :
        print("Количество предложений в Вашем тексте:", y)
    else :
        print("Включите Вашу грамотность, используйте буквы, знаки препинания и введите корректный текст")
else :
    print("Включите Вашу грамотность, используйте буквы, знаки препинания и введите корректный текст")