""" Задание 1
Пользователь вводит с клавиатуры три цифры.
Необходимо создать число, содержащее эти цифры.
Например, если с клавиатуры введено 1, 5, 7, тогда нужно сформировать число 157.
    Задание 2
Пользователь вводит с клавиатуры число, состоящее из четырех цифр.
Требуется найти произведение цифр.
Например, если с клавиатуры введено 1324, тогда результат произведения 1*3*2*4 = 24.
    Задание 3
Пользователь вводит с клавиатуры количество метров.
Требуется вывести результат перевода метров в сантиметры, дециметры, миллиметры, мили.
    Задание 4
Напишите программу, вычисляющую площадь треугольника.
Пользователь с клавиатуры вводит размер основания треугольника и размер высоты.
    Задание 5
Пользователь с клавиатуры вводит четырёхзначное число.
Необходимо перевернуть число и отобразить результат.
Например, если введено 4512, результат 2154."""

#Задание 1
x1=int(input('Введите первую цифру: '))
x2=int(input('Введите вторую цифру: '))
x3=int(input('Введите третью цифру: '))                 #перевожу каждую цифру в тип данных "строка" и складываю,
print('Ваше число=',(int(str(x1) + str(x2) + str(x3)))) #результат вывожу числом обязательно, как в задании.
#Задание 2
x1=int(input('Введите число из четырех цифр: '))
y1=x1//1000                                             #оператор //(целочисленное деление) убирает числа справа (то
y2=x1//100%10                                           #есть использован с такими значениями деления)
y3=x1//10%10                                            #оператор %(остаток) убирает числа слева (оставляет остаток)
y4=x1%10                                                #использю комбинацию этих опреаторов и получаю необходимые числа
print('Произведение цифр введеного Вами числа=',(y1*y2*y3*y4))
#Задание 3
x1=int(input('Введите расстояние в метрах: '))
print('Введеное расстояние в сантиметрах=',(x1*100))    #просто вставляю формулы перевода расстояний
print('Введенное расстояние дециметрах=',(x1*10))
print('Введенное расстояние миллиметрах=',(x1*1000))
print('Введенное расстояние миллях=',(x1/1609))
#Задание 4
x1=int(input('Введите размер основания треугольника: '))#аналогично использую формулу расчета площади треугольника
x2=int(input('Введите размер высоты треугольника: '))   #по известным данным
print('Площадь треугольника=',(x1*x2/2))
#Задание 5
x1=int(input('Введите число из четырех цифр: '))
y1=x1%10                                                #аналогично методу из второго задания с помощью сочетания
y2=x1//10%10                                            #операторов // и % вычисляю каждую цифру введеного числа
y3=x1//100%10
y4=x1//1000
print('Ваше число в обратном порядке=',int(str(y1)+str(y2)+str(y3)+str(y4))) #использую способ аналогично первому
                                                #заданию для красивого и корректного вывода перевожу полученные
                                                #значения в тип данных "строка", но финальный вывод осуществляю в число.