'''Задание 1
Пользователь вводит с клавиатуры три числа.
В зависимости от выбора пользователя программа выводит на экран
сумму трёх чисел или произведение трёх чисел.
Задание 2
Пользователь вводит с клавиатуры три числа.
В зависимости от выбора пользователя программа выводит на экран
максимум из трёх, минимум из трёх или среднеарифметическое трёх чисел.
Задание 3
Пользователь вводит с клавиатуры количество метров.
В зависимости от выбора пользователя программа переводит
метры в мили, дюймы или ярды.'''

#Задание №1
x1=int(input('Введите первое число '))
x2=int(input('Введите второе число '))
x3=int(input('Введите третье число '))
q=(input('Сложить или умножить Ваши числа? '))   #Ввел доп-ую переменную с вопросом что необходимо сделать с числами
if q=='Сложить':                                                           #В завсимости от ответа пользователя
    print ('Результат сложения (сумма) Ваших чисел= ',x1+x2+x3)            #программа производит необходимые действия и
elif q=='Умножить':                                                        #выводит результат на экран
    print ('Результат умножения (произведение) Ваших чисел= ',x1*x2*x3)
else:
    print ('Запустите программу заново и предоставьте корректный ответ на вопрос. Всего хо-ро-ше-го.')
#Задание №2
x1=int(input('Введите первое число '))
x2=int(input('Введите второе число '))
x3=int(input('Введите третье число '))
q=(input('Какое число Вас интересует - максимальное или минимальное? '
'Возможно, Вас интересует среднеарифметическое Ваших чисел?' ))
if q=='Максимальное':                                     #Решаю по аналогии с первым заданием, но ввожу
    y=x1                                                  #дополнительную переменную для вычисления наибольшего или
    if x2>y:                                              #наименьшего числа из указанных. Для этого использую каскадом
       y=x2                                               #оператор if. Оператор elif решил не использовать.
    if x3>y:
        y=x3
    print('Максимальное из указанных Вами чисел= ',y)
if q=='Минимальное':
    y=x1
    if x2<y:
        y=x2
    if x3<y:
        y=x3
    print('Минимальное из указанных Вами чисел= ',y)
if q == 'Среднеарифметическое':
    print ('Среднеарифметическое ваших чисел= ',(x1+x2+x3)/3)
else:
    print('Запустите программу заново и предоставьте корректный ответ на вопрос. Всего хо-ро-ше-го.')
#Задание №3
x=int(input('Введите количество метров '))
q=(input('Перевести метры в мили, ярды или дюймы? '))
if q=='Мили':                                                     #Для решения задания несколько раз использовал
    print('Количество миль в введеных Вами метрах: ',x/1609)      #оператор elif, так как условиями задано несколько
elif q=='Ярды':                                                   #значений для перевода расстояния пользователя.
    print('Количество ярдов в введеных Вами метрах: ',x*1.094)
elif q=='Дюймы':
    print('Количество дюймов в введеных Вами метрах: ',x*39.37)
else:
    print('Запустите программу заново и предоставьте корректный ответ на вопрос. Всего хо-ро-ше-го. '
          'И обязательно счастья.')