''''Задание 1
Пользователь вводит с клавиатуры два числа (начало и конец диапазона).
Требуется проанализировать все числа в этом диапазоне по следующему правилу:
если число кратно 7, его надо выводить на экран.
Задание 2
Пользователь вводит с клавиатуры два числа (начало и конец диапазона).
Требуется проанализировать все числа в этом диапазоне. Нужно вывести на экран:
1. Все числа диапазона;
2. Все числа диапазона в убывающем порядке;
3. Все числа, кратные 7;
4. Количество чисел, кратных 5.
Задание 3
Пользователь вводит с клавиатуры два числа (начало и конец диапазона).
Требуется проанализировать все числа в этом диапазоне.
Вывод на экран должен проходить по правилам, указанным ниже.
Если число кратно 3 (делится на 3 без остатка) нужно вывести слово Fizz. Если число кратно 5 нужно вывести слово Buzz.
Если число кратно 3 и 5 нужно вывести Fizz Buzz. Если число не кратно не 3 и 5 нужно вывести само число.'''
#Задание № 1
x = int(input('Введите первое число (начало диапазона): '))
y = int(input('Введите второе число (конец диапазона): '))
print('Числа в этом диапазоне кратные 7: ')
for z in range(x, y + 1):                   #ввожу новую  переменную изапускаю цикл в диапазоне пользователя с шагом +1
    if z % 7 == 0:                          #ввожу необходимое по заданию условие
        print(z, end =' ')
print ()
#Задание № 2
x = int(input('Введите первое число (начало диапазона): '))
y = int(input('Введите второе число (конец диапазона): '))
print(end='1.Все числа в этом диапазоне: ')
for z in range(x, y + 1):
    print(z, end=' ')
print ()
print(end='2.Все числа в этом диапазоне в убывающем порядке: ')
for z in range(y, x - 1, - 1):
    print(z, end=' ')
print ()
print(end='3.Числа в этом диапазоне кратные 7: ')
for z in range (x, y + 1):
    if z % 7 == 0:
        print (z, end = ' ')
print ()
print (end='4.Количество чисел в этом диапазоне кратных 5: ')
count = 0                                   #для подсчета кол-ва чисел ввожу счетчик и присваю ему стартовое значение 0
for z in range(x, y + 1):
    if z % 5 == 0:                          #ввожу необходимое для решения условие
        count = count + 1                   #присваиваю счетчику новое значение, в соответствии с условиями
print (count)
#Задание № 3
x = int(input('Введите первое число (начало диапазона): '))
y = int(input('Введите второе число (конец диапазона): '))
for z in range(x, y + 1):
    fizz = z % 3 == 0                 #ввожу переменную, которая будет отвечать за деление на 3
    buzz = z % 5 == 0                 #ввожу переменную, которая будет отвечать за деления на 5
    if fizz :                         #проговариваю как доношу свою мысль до Python: если получил переменную fizz
        if buzz :                     #и она одновременно является и buzz
            print(end='Fizz Buzz; ')  #то выводим на экран вместо цифры fizz buzz
        else :                        #во всех остальных случаях
            print(end='Fizz; ')       #выводим на экран fizz (касается только этого подблока)
    elif buzz:                        #если получил переменную buzz
        print(end='Buzz; ')           #выводим на экран buzz
    else:                             #во всех остальных случаях
        print(z, end = '; ')          #выводим на экран переменную z, введенную мною в цикле