'''Задание № 1:
Пользователь вводит количество недель, месяцев, лет и получает количество дней за это время. Считать что в месяце 30 дней.
Задание № 2:
Пользователь вводит три числа. Увеличьте первое число в два раза, второе уменьшите на 3, третье число возведите в
квадрат и затем найдите сумму новых трех чисел.
Задание № 3:
Пользователь вводит два числа. Если каждое из них не равно 10 и первое число четное, то вывести их сумму, иначе вывести
их произведение.
Задание № 4:
Дается две строки:
num = "0123456789" и bkv = "цБиУфКрВыЫ"
На четных позициях должны находиться четные цифры, на нечетных позициях должны находиться буквы.
Задание № 5:
Пользователь вводит строку. Определите, какой символ в ней встречается раньше: 'x' или 'w'.
Если какого-то из символов нет, то вывести сообщение об этом.
Задание № 6:
Вывести ряд чисел: десять десяток, девять девяток, восемь восьмерок, семь семерорк, шесть шестерок, пять пятерок,
четыре четверки, три тройки, две двойки, одну единицу. Найти сумму всех этих чисел.'''
#Задание № 1 (также данное задание можно решить с помощью создания функции, но я выбрал наипростейший вариант)
x = int(input("Введите количество недель, которые необходимо посчитать: "))     #ввод пользователем согласно условиям
y = int(input("Введите количество месяцев, которые необходимо посчитать: "))
z = int(input("Введите количество лет, которые необходимо посчитать: "))
x1 = 7*x            #провожу необходимые расчеты с каждым значением (перевожу в количество дней)
y1 = 30*y
z1 = 365*z
print ("Количество дней в введеном Вами временном промежутке: ", x1+y1+z1)    #вывожу результат на экран
#Задание № 2 (можно решить также с помощью создания функции, но на экзамене сложных путей не ищут)
x = int(input("Введите первое число: "))   #ввод пользователем согласно условиям
y = int(input("Введите второе число: "))
z = int(input("Введите третье число: "))
x1 = x * 2                                 #провожу необходимые расчеты с каждым значением согласно условий задания
y1 = y - 3
z1 = z * z
s = x1 + y1 + z1
print("Сумма новых чисел: ", s)            #вывожу результат на экран
#Задание № 3
x = int(input("Введите Ваше первое число: "))  #ввод пользователем согласно условиям
y = int(input("Введите Ваше второе число: "))
if x != 10 and y != 10 and x % 2 == 0:  #ввожу ветвление и задаю условия согласно задания
    r = x + y                           #провожу действие согласно задания в зависимости от выполнения условий
    print ("Согласно задания, Вы получаете результат сложения чисел: ", r)
else:
    r = x * y
    print("Согласно задания, Вы получаете результат умножения чисел: ", r)
#Задание № 4
num = "0123456789"      #задаю значения строк согласно задания
bkv = "цБиУФКрВыЫ"
r = ""                  #ввожу пустую переменную для записи результата
for z in range(len(num)):  #запускаю цикл в диапазоне длины строки с цифрами
    if z % 2 == 0:         #внутри цикла ввожу ветвление и задаю его условия согласно задания
        r += num[z]        #и записываю результат в ранее созданную переменную
    else:                  #если условие не выполняется
        r += bkv[z]        #то записываю в строку с результатом значение из строки с буквами
print("В результате  получаем строку: ", r)
#Задание № 5
x = input("Введите Вашу строку: ")
x1 = x.find('x')                    #использую метод строки .find для поиска символов согласно задания
x2 = x.find('w')
if x1 == -1 and x2 == -1:           #ввожу ветвление с условием согласно задания
    print("В Вашей строке символы 'x' и 'w' отсутствуют")
elif x1 == -1:                      #и в зависимости от выполнения или не выполнения условий
    print("В Вашей строке отсутсвует символ 'x'")   #вывожу на экран
elif x2 == -1:
    print("В Вашей строке отсутсвует символ 'w'")
else:
    if x1 < x2:
        print("В Вашей строке cимвол 'x' встречается раньше символа 'w'")
    else:
        print("В Вашей строке cимвол 'w' встречается раньше символа 'x'")
#Задание № 6
x = [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]    #создаю два списка с необходимыми по заданию значениями
y = [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]
r = 0                                  #создаю переменную для записи значений
for i in range(len(x)):                #запускаю цикл в диапазоне длины списка
    z = x[i]                           #присваиваю переменной каждое значение из списка
    z1 = y[i]
    print((str(z) + " ") * z1)         #преобразую в строку и вывожу на экран согласно задания
    r = r + z * z1                     #произвожу расчет согласно задания
print("Сумма всех чисел:", r)          #вывожу на экран результат
#и отмечаю сдачу экзамена и завершение курса по Python большим глотком вкусного чая.