'''Задание 1
Пользователь вводит с клавиатуры целое шестизначное число. Написать программу, которая определяет,
является ли введенное число — счастливым (Счастливым считается шестизначное число, у которого сумма
первых 3 цифр равна сумме вторых трех цифр).
Например, 123321 - счастливое число, так как 1+2+3=3+2+1.
С другой стороны 378423 несчастливое число, так как 3+7+8 != 4+2+3.
Если пользователь ввел не шестизначное число требуется вывести сообщение об ошибке.
Задание 2
Пользователь вводит шестизначное число.Необходимо поменять в этом числе первую и шестую, а также вторую и пятую цифры.
Например, 723895 должно превратиться в 593827.
Если пользователь ввел не шестизначное число требуется вывести сообщение об ошибке.
Задание 3
Пользователь вводит с клавиатуры номер месяца (от 1 до 12).
В зависимости от полученного номера месяца программа выводит на экран надпись:
Winter (если введено значение 1,2 или 12),
Spring (если введено значение от 3 до 5),
Summer (если введено значение от 6 до 8),
Autumn (если введено значение от 9 до 11).
Если пользователь ввел значение не в диапазоне от 1 до 12 требуется вывести сообщение об ошибке.'''
# Задание 1
x = int(input('Введите целое шестизначное число: '))
if  99999 < x < 1000000 :        #не могу создать условие чтобы число 001001 (тоже целое шестизначное число)
    y1 = int(x // 100000)        #проходил проверку на шестизначность
    y2 = int(x // 10000 % 10)
    y3 = int(x // 1000 % 10)
    y4 = int(x // 100 % 10)
    y5 = int(x // 10 % 10)
    y6 = int(x % 10)
    a = y1 + y2 + y3
    b = y4 + y5 + y6
    if a == b:
        print('Поздравляю. У Вас счастливое число. И Вы обязаны быть счастливым.')
    else:
        print('Увы. Ваше число не является счастливым. Но на Ваше счастье это не имеет никакого влияния.')
else:
    print ('Введите корректное целое шестизначное число')
#Задание № 2
x = int(input('Введите шестизначное число: '))
if  99999 < x < 1000000 :    #аналогично первому заданию не могу подобрать условие, соглано условию задачи, чтобы x
    y1 = int(x // 100000)    #удовлетворяла шестизначному числу (9.99999 тоже шестизначное число)
    y2 = int(x // 10000 % 10)
    y3 = int(x // 1000 % 10)
    y4 = int(x // 100 % 10)
    y5 = int(x // 10 % 10)
    y6 = int(x % 10)
    print('Ваше новое число: ', int(str(y6) + str(y5) + str(y3) + str(y4) + str(y2) + str(y1)))
else:
    print ('Введите корректное шестизначное число')
# Задание № 3
x = int(input('Введите порядковый номер месяца: '))
if  x == 12 :                                             #для вывода Winter удобнее было бы использовать
    print ('Winter')                                      #оператор or и обьединить условия x == 12 и 0 < x <= 2
elif 0 < x <= 2 :
    print ('Winter')
elif 3 <= x <= 5 :
    print ('Spring')
elif 6 <= x <= 8 :
    print ('Summer')
elif 9 <= x <= 11 :
    print ('Autumn')
else :
    print ('Введите верный номер месяца')