''''Задание 1
Пользователь вводит с клавиатуры два числа. Нужно посчитать сумму чисел в указанном диапазоне, а также
среднеарифметическое.
Задание 2
Пользователь вводит с клавиатуры число. Требуется посчитать факториал числа.
Например, если введено 3, факториал числа 1*2*3 = 6.
Формула для расчета факториала: n! = 1*2*3…*n,где
n — число для расчета факториала.
Задание 3
Пользователь вводит с клавиатуры длину линии. Нужно отобразить на экране горизонтальную линию
из *, указанной длины.
Например, если было введено 7, тогда вывод на экран будет такой: *******.
Задание 4
Пользователь вводит с клавиатуры длину линии и символ для заполнения линии. Нужно отобразить на
экране горизонтальную линию из введенного символа, указанной длины.
Например, если было введено 5 и &, тогда вывод на  экран будет такой: &&&&&.'''
#Задание № 1
x = int(input('Введите первое число: '))
y = int(input('Введите второе число: '))
s = 0                          #ввожу переменную для суммы диапазона
count = 0                      #ввожу счетчик для подсчета среднеарифметического
for z in range (x, y + 1) :    #запускаю цикл для указаного диапазона
    s = s + z                  #считаю сумму чисел в диапазоне
    count = count + 1          #считаю по счетчику количество чисел в диапазоне
    sa = s / count             #ввожу переменную и считаю среднеарифметическое диапазона
print ('Сумма чисел в диапазоне: ', s)
print ('Среднеарифметическое диапазона: ', sa)
#Задание № 2
x = int(input('Введите число: '))
f = 1                            #ввожу переменную для факториала (со значением 1, согласно определения факториала)
for z in range (1, x + 1) :      #запускаю цикл для определения диапазона (начинаю с 1, согласно определения факториала)
    f = f*z                      #вычисляю произведение всех натуральных чисел в диапазоне
print ('Факториал введенного числа: ', f)
#Задание № 3
x = int(input('Введите длину линии: '))
for z in range (x) :             #запускаю цикл в одном значении переменной пользователя
    print (end= '*' )            #вывожу длину указанным символом
print ()
#Задание № 4
x = int(input('Введите длину линии: '))                      #решаю по аналогии с третьим заданием, только ввожу
y = (input('Из какого символа вывести длину Вашей линии? ')) #переменную с указанием символа
for z in range (x) :                                         #пользователем для вывода длины
    print (end= y)
