'''Задание 1
Пользователь вводит с клавиатуры строку. Произведите поворот строк и полученный результат выведите на экран.
Задание 2
Пользователь вводит с клавиатуры строку. Посчитайте количество букв, цифр в строке. Выведите оба количества на экран.
Задание 3
Пользователь вводит с клавиатуры строку и символ для поиска. Посчитайте сколько раз в строке встречается
искомый символ. Полученное число выведите на экран.
Задание 4
Пользователь вводит с клавиатуры строку и слово для поиска. Посчитайте сколько раз в строке встречается
искомое слово. Полученное число выведите на экран.
Задание 5
Пользователь вводит с клавиатуры строку, слово для поиска, слово для замены. Произведите в строке замену
одного слова на другое. Полученную строку отобразите на экране'''
#Задание №1
x = input("Введите строку: ")
y = x[::-1]                             #использую срез строки с шагом -1 для обратного порядка
print('Ваша строка в "перевернутом" виде:', y)
#Задание №2
x = input("Введите строку: ")
y = 0                                   #задал переменную для букв
z = 0                                   #задал переменную для чисел
for str in x:                           #запускаю цикл для вычисления цифр и букв используя изученные методы строк
    if str.isalpha():
        y += 1                          #и присваиваю новые значения соответствующей переменной
    elif str.isdigit():
        z += 1
print("Количество букв в Вашей строке:", y)
print("Количество цифр в Вашей строке:", z)
#Задание №3
x = input("Введите строку: ")
y = input("Введите символ для поиска: ")
c = 0                         #ввожу переменную для счетчика количества символов
str = x.find (y)
while str != -1:              #запускаю цикл для подсчета количества символа до конца строки
    c += 1
    str = x.find(y, str + 1)
print("Символ '{}' встречается в Вашей строке {} раз(а).".format(y, c)) #использую метод format для удобства вывода
#Задание №4
x = input("Введите строку: ")
y = input("Введите слово для поиска: ")
c = x.count (y)                         #ввожу переменную и присваиваю ей значение с использованием метода строки
print("Слово '{}' встречается в Вашей строке {} раз(а).".format(y, c)) #использую метод format для удобства вывода
#Задание №5
import re                                   #импортирую метод re
x = input("Введите строку: ")
y = input("Введите слово для поиска: ")
z = input("Введите слово для замены: ")
n = re.sub(y, z, x)                         #и использую функцию re.sub для поиска и фрагмента (слова) в строке
print("Полученная строка с заменой:", n)