'''Задание 1
Есть некоторый текст. Реализуйте следующую функциональность:
■ Изменить текст таким образом, чтобы каждое предложение начиналось с большой буквы;
■ Посчитайте сколько раз цифры встречаются в тексте;
■ Посчитайте сколько раз знаки препинания встречаются в тексте;
■ Посчитайте количество восклицательных знаков в тексте.
Задание 2
Пользователь с клавиатуры вводит элементы списка целых и некоторое число.
Необходимо посчитать сколько раз данное число присутствует в списке. Результат вывести на экран.
Задание 3
Пользователь с клавиатурывводит элементы списка целых. Необходимо посчитать сумму всех элементов
и их среднеарифметическое. Результаты вывести на экран.'''
#Задание №1
import re
x = "это пример, он содержит предложения.и 12234 цифры! Присутствует знак вопроса?"
x2 = re.split(r'([.!?...]+)', x)     #использую метод для разделения на список по определенным знакам
n = []                                      #создаю пустой массив (список) для будущего объединения
for p in x2:                                #запускаю цикл для разделенных значений списка
    x3 = p.lstrip().capitalize()            #убираю лишние пробелы и каждое предложение начинаю с большой буквы
    n.append(x3)                            #объединяю в один список каждую часть
nn = ''.join(n)                             #и соединяю в строку все элемента списка согласно условиям
y = len(re.findall(r'\d', x))        #ищу количество цифр в тексте
y1 = len(re.findall(r'[.,!?]', x))   #ищу количество знаков препинания
print (nn)
print ('Количество цифр в тексте: ', y)
print ('Количество знаков препинания в тексте: ', y1)
print ('Количество восклицательных знаков в тексте: ', x.count('!'))
#Задание №2
x = input("Введите список целых чисел через пробел: ")
x1 = x.split()                      #разделяю строку на отдельные числа
n = []                              #создаю списка для целых чисел
for nn in x1:                       #запускаю цикл для преобразования строки в целые числа
    c = int(nn)
    n.append(c)                     #добавляю целое число в ранее созданный список
y = int(input("Введите целевое число: "))
count = 0                           #создаю мой любимый счетчик
for c in n:                         #запускаю цикл для подсчета количества вхождений введенного пользователем числа
    if c == y:
        count += 1                  #и присваиваю счетчику новое значение
print(f"Количество вхождений числа {y} в списке: {count}")   #для удобства использовал метод format
#Задание №3
x = input("Введите список целых чисел через пробел: ")
x1 = x.split()                      #разделяю строку на отдельные числа
n = []                              #создаю списка для целых чисел
for nn in x1:                       #запускаю цикл для преобразования строки в целые числа
    c = int(nn)
    n.append(c)                     #добавляю целое число в ранее созданный список
s = sum(n)                          #считаю сумму чисел
sr = s / len(n)                     #считаю среднее арифметическое
print(f"Сумма всех элементов списка: {s}")      #и использую метод формат для удобства
print(f"Среднее арифметическое: {sr}")









