'''Задание 1
Пользователь вводит с клавиатуры число. Необходимо проверить его на четность и нечетность.
Если число четное требуется вывести на экран число и надпись Even number.
Если число нечетное выведите на экран число и надпись Odd number.
Задание 2
Пользователь вводит с клавиатуры число. Необходимо проверить его на кратность 7.
Если число кратно требуется вывести на экран число и надпись Number is multiple 7.
Если число не кратно выведите на экран число и надпись Number is not multiple 7.
Задание 3
Пользователь вводит с клавиатуры два числа. Необходимо найти максимум из двух чисел и показать его на экран.
Задание 4
Пользователь вводит с клавиатуры два числа. Необходимо найти минимум из двух чисел и показать его на
экран.
Задание 5
Пользователь вводит с клавиатуры два числа. В зависимости от выбора пользователя нужно показать сумму
двух чисел, разницу двух чисел, среднеарифметическое или произведение двух чисел.'''
#Задание №1
x = int (input('Введите Ваше число: '))
if x % 2 == 0 :
    print (x, '- Even Number')
else :
    print (x, '- Odd number')
#Задание №2
x = int (input('Введите Ваше число: '))
if x % 7 == 0 :
    print (x, '- Number is multiple 7')
else :
    print (x, '- Number is not multiple 7')
#Задание №3
x = int (input('Введите первое число: '))
y = int (input('Введите второе число: '))
if x > y :
    print (x, '- максимальное число из введеных Вами')
else :
    print (y, '- максимальное число из введеных Вами')
#Задание № 4
x = int (input('Введите первое число: '))
y = int (input('Введите второе число: '))
if x < y :
    print (x, '- минимальное число из введеных Вами')
else :
    print (y, '- минимальное число из введеных Вами')
#Задание № 5
x = int (input('Введите первое число: '))
y = int (input('Введите второе число: '))
q = (input ('Вам нужна сумма, разница, среднеарифметическое или произведение введенных Вами чисел? '))
if q == 'Сумма' :
     print ('Сумма введенных Вами чисел: ', x+y)
elif q == 'Разница' :
     print('Разница введеных Вами чисел: ', x-y)
elif q == 'Среднеарифметическое' :
    print ('Среднеарифметическое введеных Вами чисел: ', (x+y)/2)
elif q == 'Произведение' :
    print ('Произведение введенных Вами чисел: ', x*y)
else :
    print ('Предоставьте корректный ответ.')