'''Задание 1
Пользователь вводит с клавиатуры время в секундах, прошедшее с начала дня. В зависимости от выбора
пользователя посчитать, сколько часов, минут и секунд осталось до полуночи.
Задание 2
Пользователь вводит с клавиатуры диаметр окружности. В зависимости от выбора пользователя посчитать
площадь или периметр окружности.
Задание 3
Пользователь вводит с клавиатуры стоимость одной
игровой приставки, их количество и процент скидки. В зависимости от выбора пользователя посчитать общую
сумму заказа или стоимость одной приставки с учетом скидки.
Задание 4
Пользователь вводит с клавиатуры размер файла в гигабайтах и скорость интернет соединения в битах в секунду.
В зависимости от выбора пользователя посчитать, за сколько часов или минут, или секунд скачается файл.
Задание 5
Пользователь с клавиатуры вводит количество часов. Если полученное значение находится в диапазоне от 0 до 6
нужно вывести надпись Good Night, если в диапазоне от 6 до 13 Good Morning, если в диапазоне от 13 до 17 Good Day,
если в диапазоне от 17 до 0 Good Evening. Верхняя граница диапазона не включается.
Например, число 6 относится к 6 до 13'''
#Задание № 1
x = int(input('Введите время в секундах, прошедшее с начала дня: '))
q = (input('Вас интересует сколько осталось часов, минут или секунд до конца дня? '))
y = 86400-x         #эта переменная дает нам информацию сколько секунд осталось до конца дня (в сутках 86400 секунд)
if q == 'Часов':
    print ('До конца дня осталось часов: ', y//3600)   # в 1 часе 3600 секунд
elif q == 'Минут' :
    print ('До конца дня осталось минут: ', y//60)     # в 1 минуте 60 секунд
elif q == 'Секунд':
    print('До конца дня осталось секунд: ', y)
else :
    print ('Введите корректный ответ с большой буквы')
#Задание № 2
x = int(input('Введите диаметр окружности '))
q = (input('Вас интересует площадь или периметр окружности? '))
if q == 'Площадь' :
    print ('Площадь Вашей окружности равна: ', (x*x)/4*3.14)
elif q == ('Периметр') :
    print ('Периметр Вашей окружности: ', x*3.14)
else :
    print ('Предоставьте корректный ответ')
#Задание №3
x = int(input('Введите стоимость одной приставки: '))
y = int(input('Введите количество приставок: '))
z = int(input('Введите процент скидки: '))
q = (input('Вас интересует "общая стоимость" или "стоимость одной приставки" с учетом скидки? '))
if q == 'Общая стоимость' :
    print ('Общая стоимость заказа: ', x*y*(1-z/100) )
elif q == 'Стоимость одной приставки' :
    print ('Стоимость одной приставки с учетом скидки: ', x*(1-z/100), )
else :
    print ('Введите корректный ответ с большой буквы (в вопросе он выделен кавычками)')
# Задание №4
x = int(input('Введите размер файла в гигабайтах: '))
y = int(input('Введите скорость соединения в битах в секунду: '))
z = x*8589934592     #перевожу гигабайты в биты
q = (input('Вас интересует за сколько часов, минут или секунд скачается файл? '))
if q == 'Часов' :
    print ('Ваш файл скачается за указанное количество часов: ', z/y/3600)  #вычисляем время в секундах и переводим в часы
elif q == 'Минут' :
    print ('Ваш файл скачается за указанное количество минут: ', z/y/60 )
elif q == 'Секунд' :
    print ('Ваш файл скачается за указанное количество секунд: ', z/y)
else :
    print ('Предоставьте корректный ответ')
# Задание №5
x = int(input('Введите сколько сейчас часов на часах: '))
if 0 <= x < 6 :
    print ('Good night')
elif 6 <= x < 13 :
    print ('Good morning')
elif 13 <= x < 17 :
    print ('Good day')
elif 17 <= x < 0 :
    print ('Good evening')
else :
    print ("Введите правильное количество часов")

